1. 斯特林公式:
#define e exp(1.0)
log10(n!) = log10(sqrt(2 * pi * n)) + n * log10(n / e)

2. 平方和公式：
1^2+2^2+3^2+...+n^2=n(n+1)(2n+1)/6

3. 立方和公式：
1^3+2^3+3^3+...+n^3=[n(n+1)/2]^2

4.那罗延数
a.那罗延数N(n,k)的计算公式：
N(n,k) = 1/n * C(n,k) * C(n,k-1)
b.那罗延三角前八项：
k 1 2  3   4   5   6   7  8 
_
n
1 1
2 1 1
3 1 3  1
4 1 6  6   1
5 1 10 20  10  1
6 1 15 50  50  15  1
7 1 21 105 175 105 21  1
8 1 28 196 490 490 196 28 1
c.应用：
在由n对"("和")"组成的字符串中，共有k对"("与")"相邻，这样的字符串一共有N(n,k)个。例如n=4,k=2时，N(n,k)=6
d.性质：
那罗延三角中每一行的和为卡特兰数，即
N(n,1) + N(n,2) + N(n,3) + ... + N(n,n) = Catalan(n)

5. 
a * b % c = 0 -> a % (c/gcd(b,c)) = 0
a / b % c = 0 -> a % (bc) = 0

6.费马小定理
a^(p-1) % p = 1, 如果p为质数，且gcd(a,p)=1

7.欧拉定理
a^phi(n) % n = 1, 如果n,a为正整数，且n,a互质
