1.了解windows、unix、linux等主流操作系统原理 Shell编程
2.熟悉手机研发平台(Android/iPhone/windows phone 7等)者优先
3.熟悉HTML/WML/CSS等相关规范
4.熟悉Javascript与DOM规范
5.熟悉webkit或其他任意一种浏览器内核
6.熟悉HTML5编程技术
7.熟悉数据库原理和技术,熟练使用SQL,能够熟练编写SQL脚本
8.熟悉TCP/IP，HTTP，HTTPS等网络协议优先
9.Ajax
10.至少掌握perl/python/shell一种脚本语言
11.熟练使用调试工具
12.你熟悉网络编程和多线程编程，对TCP/IP，HTTP等网络协议有很深的理解，并了解XML和HTML语言
13.可以熟练使用各种 Web 前端技术，包括(X)HTML/CSS/Javascript/JSON 等
14.网络编程、分布式系统
15.有开源项目经验
随便找本面试的书，上面C++讲啥基本就问啥。
无非就是什么虚继承啊，虚函数表之类的
问张永辉平台该怎么部署

找相关学长：
汪健慈
黄海坤
百度有什么人啊
江以臣
小杰哥

[江游]无为战士(787334529)  18:58:40
上海江游招2016届应届实习生，只要求ACM区域赛银牌及以上（不包括邀请赛）
1月18日正式开始，实习工资6K，转正后不低于10K/月(包吃3餐，从实习开始包住一年)
有兴趣的发简历到787334529@qq.com
